Friends | List of all members
ACAPI::MEP::v1::DuctPreferenceTableContainer Class Referencefinal
MEP Element Manager
The DuctPreferenceTableContainer can contain several PreferenceTableBase associated with ventilation. More...
#include <MEPDuctPreferenceTableContainer.hpp>
 Inheritance diagram for ACAPI::MEP::v1::DuctPreferenceTableContainer:
 Friends
Result< DuctPreferenceTableContainer >  | GetDuctPreferenceTableContainer ()
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::v1::PreferenceTableContainerBase
bool  | Exists () const
std::vector< UniqueID >  | GetPreferenceTables () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
Result< UniqueID >  | AddNewTable (GS::UniString tableName)
Inserts a new preference table into the container.
Result< void >  | Delete (const UniqueID &uniqueId)
Deletes a preference table from the container.
 Protected Member Functions inherited from ACAPI::MEP::v1::PreferenceTableContainerBase
PreferenceTableContainerBase (std::shared_ptr< Impl::IPreferenceTableContainerBaseImpl >)
Modifier (PreferenceTableContainerBase &)
Detailed Description
The DuctPreferenceTableContainer can contain several PreferenceTableBase associated with ventilation.
Since
Archicad 27
The container is already initialized (but may be empty) and you can access it by calling GetDuctPreferenceContainer.
Example code snippet from Test / New MEP
Take a look at PreferenceTableContainerBase
Friends And Related Symbol Documentation
◆ GetDuctPreferenceTableContainer
 Result< DuctPreferenceTableContainer > GetDuctPreferenceTableContainer  |  ( |   | )
friend
Returns
If able, returns the DuctPreferenceTableContainer from the project.